# Normalization and Scaling
- view the difference and understanding from the  [link➡️](https://www.kaggle.com/code/alexisbcook/scaling-and-normalization)

In [17]:
import pandas as pd
import numpy as np

In [18]:
path =r'F:\Python\Practice\sample_dataset.csv'
data=pd.read_csv(path)
df=pd.read_csv(path)


data.head()

,id,name,age,income,purchase_date,product_category,purchase_amount,is_returned
0,e3e70682-c209-4cac-a29f-6fbed82c07cd,Thomas Gonzalez,42.0,92701.95,2021-04-14,Clothing,261.01,1
1,f728b4fa-4248-4e3a-8a5d-2f346baa9455,Christopher Barrett,66.0,67632.79,2021-06-14,Sports,318.51,1
2,eb1167b3-67a9-4378-bc65-c1e582e2e662,Kathy Willis,44.0,22836.08,2021-03-31,Electronics,370.91,0
3,f7c1bd87-4da5-4709-9471-3d60c8a70639,Shannon Bullock,20.0,83378.92,2023-11-04,Clothing,77.07,1
4,e443df78-9558-467f-9ba9-1faf7a024204,Steven Johnson,34.0,44448.31,2020-01-12,Home & Kitchen,256.40,0

In [19]:
data=data.drop(columns=['id','name','product_category','purchase_date'])
data.head()

    age    income  purchase_amount  is_returned
0  42.0  92701.95           261.01            1
1  66.0  67632.79           318.51            1
2  44.0  22836.08           370.91            0
3  20.0  83378.92            77.07            1
4  34.0  44448.31           256.40            0

# sklearn
- used from Scaling
- Documents can be viewed from  [link](https://scikit-learn.org/stable/)
- Classification in scikit learn is going to be used. [[link ➡️]](https://scikit-learn.org/stable/)

In [20]:
from sklearn.preprocessing import StandardScaler,MinMaxScaler
scaler= StandardScaler()
data_scaled= scaler.fit_transform(data)
data_scaled

array([[-0.11497117,  0.22079014, -0.09879538,  0.99203175],
       [ 1.42082185, -0.02730732,  0.01253117,  0.99203175],
       [ 0.01301158, -0.47063888,  0.11398355, -1.00803226],
       ...,
       [-0.49891943, -0.27423629, -0.23726625,  0.99203175],
       [ 1.42082185,  0.0185204 , -0.07178659, -1.00803226],
       [        nan, -0.02411104,         nan, -1.00803226]])

In [21]:
#using the min max scaler
minmax_scaler=MinMaxScaler()
data_normalized=minmax_scaler.fit_transform(data)
data_normalized

array([[0.46153846, 0.07407981, 0.05124714, 1.        ],
       [0.92307692, 0.04849344, 0.06276043, 1.        ],
       [0.5       , 0.0027725 , 0.07325253, 0.        ],
       ...,
       [0.34615385, 0.02302757, 0.03692661, 1.        ],
       [0.92307692, 0.05321966, 0.05404036, 0.        ],
       [       nan, 0.04882307,        nan, 0.        ]])

## Encoding Categorical variables
- encoding helps to handle data such as date and ids

In [22]:
df= df.drop(columns=['id','name'])
df.head()

    age    income purchase_date product_category  purchase_amount  is_returned
0  42.0  92701.95    2021-04-14         Clothing           261.01            1
1  66.0  67632.79    2021-06-14           Sports           318.51            1
2  44.0  22836.08    2021-03-31      Electronics           370.91            0
3  20.0  83378.92    2023-11-04         Clothing            77.07            1
4  34.0  44448.31    2020-01-12   Home & Kitchen           256.40            0

In [25]:
#encoding categorical data
from sklearn.preprocessing import LabelEncoder,OneHotEncoder

encoder=OneHotEncoder()
categorical_data_encoded = encoder.fit_transform(df)
categorical_data_encoded

<1000x2603 sparse matrix of type '<class 'numpy.float64'>'
	with 6000 stored elements in Compressed Sparse Row format>

In [27]:
# label encoding
# label_encoder=LabelEncoder()
# label_encoded = label_encoder.fit_transform(df)
# label_encoded

## Extracting Date time features

In [28]:
df.head()

    age    income purchase_date product_category  purchase_amount  is_returned
0  42.0  92701.95    2021-04-14         Clothing           261.01            1
1  66.0  67632.79    2021-06-14           Sports           318.51            1
2  44.0  22836.08    2021-03-31      Electronics           370.91            0
3  20.0  83378.92    2023-11-04         Clothing            77.07            1
4  34.0  44448.31    2020-01-12   Home & Kitchen           256.40            0

In [30]:
df['purchase_date']= pd.to_datetime(df['purchase_date'])
df['Year']=df['purchase_date'].dt.year
df['Month']=df['purchase_date'].dt.month
df.head()

,age,income,purchase_date,product_category,purchase_amount,is_returned,Year,Month
0,42.0,92701.95,2021-04-14,Clothing,261.01,1,2021,4
1,66.0,67632.79,2021-06-14,Sports,318.51,1,2021,6
2,44.0,22836.08,2021-03-31,Electronics,370.91,0,2021,3
3,20.0,83378.92,2023-11-04,Clothing,77.07,1,2023,11
4,34.0,44448.31,2020-01-12,Home & Kitchen,256.40,0,2020,1